app/views/casting_offices/index.html.erb

<br>
  <% if current_agency.casting_offices.empty? %>
---
SELECT "casting_offices".* FROM "casting_offices" WHERE "casting_offices"."agency_id" = $1  [["agency_id", 1]]
SELECT 1 AS one FROM "casting_offices" WHERE "casting_offices"."agency_id" = $1 LIMIT $2  [["agency_id", 2], ["LIMIT", 1]]

    <tbody>
    <% current_agency.casting_offices.each do |casting_office| %>
---
SELECT "casting_offices".* FROM "casting_offices" WHERE "casting_offices"."agency_id" = $1  [["agency_id", 2]]