app/views/actors/index.html.erb

SELECT "actors".* FROM "actors" WHERE "actors"."agency_id" = $1  [["agency_id", 1]]
SELECT 1 AS one FROM "actors" WHERE "actors"."agency_id" = $1 LIMIT $2  [["agency_id", 2], ["LIMIT", 1]]
---
<br>
  <% if current_agency.actors.empty? %>

SELECT "actors".* FROM "actors" WHERE "actors"."agency_id" = $1  [["agency_id", 2]]
---
    <tbody>
      <% current_agency.actors.each do |actor| %>