app/views/bookings/index.html.erb

SELECT "bookings".* FROM "bookings" WHERE "bookings"."agency_id" = $1  [["agency_id", 1]]
SELECT 1 AS one FROM "bookings" WHERE "bookings"."agency_id" = $1 LIMIT $2  [["agency_id", 2], ["LIMIT", 1]]
---
<br>
  <% if current_agency.bookings.empty? %>

SELECT "bookings".* FROM "bookings" WHERE "bookings"."agency_id" = $1  [["agency_id", 2]]
---
    <tbody>
      <% current_agency.bookings.each do |booking| %>