app/views/users/new.html.erb

SELECT "accounts".* FROM "accounts"
---
    <%= f.label :account_id, "Representation Account" %>
    <%= f.collection_select :account_id, Account.all, :id, :name, prompt: "Please select your office's account" %>