app/views/projects/index.html.erb

SELECT "projects".* FROM "projects" WHERE "projects"."agency_id" = $1  [["agency_id", 1]]
SELECT 1 AS one FROM "projects" WHERE "projects"."agency_id" = $1 LIMIT $2  [["agency_id", 1], ["LIMIT", 1]]
---
<br>
  <% if current_agency.projects.empty? %>

SELECT "projects".* FROM "projects" WHERE "projects"."agency_id" = $1  [["agency_id", 1]]
---
    <tbody>
      <% current_agency.projects.each do |project| %>