app/views/projects/new.html.erb

    <p>
      <%= f.collection_select :casting_office_id, CastingOffice.all, :id, :name %>
---
SELECT "casting_offices".* FROM "casting_offices"