app/helpers/users_helper.rb

SELECT "agencies".* FROM "agencies"
---
    def agency_id_field(user)
      if user.agency.nil?
        select_tag "user[agency_id]", options_from_collection_for_select(Agency.all, :id, :name), prompt: "Please select your Agency"

SELECT COUNT(*) FROM "users" WHERE "users"."agency_id" = $1  [["agency_id", 3]]
---
    def first_user?(user)
        !user.agency.nil? && user.agency.users.count <= 1