app/controllers/actors_controller.rb

INSERT INTO "actors" ("first_name", "last_name", "email", "gender_portrayal", "sag_aftra", "aea", "dob", "location", "notes", "agency_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @actor = Actor.new(actor_params)
    if @actor.valid?
      @actor.save

DELETE FROM "actors" WHERE "actors"."id" = $1  [["id", 4]]
---
  def destroy
    @actor = Actor.find(params[:id])
    @actor.destroy