app/controllers/agencies_controller.rb

INSERT INTO "agencies" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Test"], ["email", "test@test.com"], ["created_at", "2020-01-08 18:31:22.664793"], ["updated_at", "2020-01-08 18:31:22.664793"]]
---
  def create
    binding.pry
    @agency = Agency.new(agency_params)
      if @agency.valid?
        @agency.save