app/controllers/appointments_controller.rb

INSERT INTO "appointments" ("role", "time", "address", "callback", "booking_status", "notes", "actor_id", "casting_office_id", "project_id", "created_at", "updated_at", "agency_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @appointment = Appointment.new(appointment_params)
    #@appointment.assign_casting
    if @appointment.valid?
      @appointment.save