app/controllers/bookings_controller.rb

  def create
    @booking = Booking.new(booking_params)

    if @booking.valid?
      @booking.save
---
INSERT INTO "bookings" ("role", "contract_signed", "accepted", "actor_id", "project_id", "created_at", "updated_at", "agency_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    @booking = Booking.find(params[:id])
    @booking.update(booking_params)
---
UPDATE "bookings" SET "contract_signed" = $1, "updated_at" = $2 WHERE "bookings"."id" = $3  [["contract_signed", false], ["updated_at", "2020-01-23 03:28:20.998011"], ["id", 1]]

  def destroy
    @booking = Booking.find(params[:id])
    @booking.destroy
---
DELETE FROM "bookings" WHERE "bookings"."id" = $1  [["id", 2]]