app/controllers/casting_offices_controller.rb

INSERT INTO "casting_offices" ("name", "email", "office_number", "location", "notes", "created_at", "updated_at", "agency_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @casting_office = CastingOffice.new(casting_office_params)
    if @casting_office.valid?
      @casting_office.save

UPDATE "casting_offices" SET "email" = $1, "office_number" = $2, "location" = $3, "notes" = $4, "updated_at" = $5 WHERE "casting_offices"."id" = $6
---
  def update
    @casting_office = CastingOffice.find(params[:id])
    @casting_office.update(casting_office_params)

DELETE FROM "casting_offices" WHERE "casting_offices"."id" = $1  [["id", 5]]
---
  def destroy
    @casting_office = CastingOffice.find(params[:id])
    @casting_office.destroy