app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "media_type", "start_date", "union", "notes", "casting_office_id", "created_at", "updated_at", "agency_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @project = Project.new(project_params)

    if @project.valid?
      @project.save

DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 9]]
---
  def destroy
    @project = Project.find(params[:id])
    @project.destroy

UPDATE "projects" SET "start_date" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["start_date", "2024-06-08"], ["updated_at", "2020-01-23 21:09:43.504150"], ["id", 4]]
---
  def update
    @project = Project.find(params[:id])
    @project.update(project_params)