app/controllers/users_controller.rb

  def new
    if params[:agency_id] && !Agency.exists?(params[:agency_id])
---
SELECT "agencies".* FROM "agencies" ORDER BY "agencies"."id" DESC LIMIT $1  [["LIMIT", 1]]

  def create
      @user = User.new(user_params)
      if @user.valid?
        @user.save
---
INSERT INTO "users" ("username", "first_name", "last_name", "email", "password_digest", "confirmed", "agency_id", "created_at", "updated_at", "admin") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def show
    if User.find_by(id: params[:id]) && session[:user_id]
      @user = User.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]