app/models/project.rb

    def casting_office_attributes=(name)
        self.casting_office = CastingOffice.find_or_create_by(name: casting_office_attributes[:name]) unless casting_office_attributes[:name].blank?
---
SELECT 1 AS one FROM "casting_offices" WHERE "casting_offices"."name" = $1 LIMIT $2  [["name", "Carmen Cuba Casting"], ["LIMIT", 1]]
INSERT INTO "casting_offices" ("name", "created_at", "updated_at", "agency_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Tom Civ Only"], ["created_at", "2020-01-16 03:10:30.903228"], ["updated_at", "2020-01-16 03:10:30.903228"], ["agency_id", 1]]
SELECT "casting_offices".* FROM "casting_offices" WHERE "casting_offices"."name" = $1 LIMIT $2  [["name", "asdfdsfd"], ["LIMIT", 1]]