app/models/user.rb

SELECT COUNT(*) FROM "users" WHERE "users"."agency_id" = $1  [["agency_id", 2]]
---
    def first_user?
        !self.agency.nil? && self.agency.users.count == 0