app/models/user.rb

SELECT COUNT(*) FROM "users" WHERE "users"."agency_id" = $1  [["agency_id", 1]]
---
    def admin_if_first_user
      if !self.agency.nil? && self.agency.users.count == 0