app/views/appointments/index.html.erb

<br>
  <% if current_agency.appointments.empty? %>
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."agency_id" = $1  [["agency_id", 1]]
SELECT 1 AS one FROM "appointments" WHERE "appointments"."agency_id" = $1 LIMIT $2  [["agency_id", 2], ["LIMIT", 1]]

    <tbody>
      <% current_agency.appointments.each do |appointment| %>
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."agency_id" = $1  [["agency_id", 2]]